# language: ru

Функционал:

  Сценарий: №1 Домашнее задание по занятию 28
    * пользователь входит на сайт "https://auto.ru/"
    * Название страницы содержит "(Авто\.ру)(.+)"
    * Сохранение кол. объявлений отображаемых перед названием производителя "Chery"
    * Переход на страницу с объявлением прозводителя автомобиля "Chery"
    * Проверка отображения кнопки с текстом содержащим колличество объявлений
    * Сохранить количество объявлений "Tiggo 3" марки автомобиля
    * Перейти на страницу "Tiggo 3"
    * Отображается кнопка содержаще количество объявлений из предыдущего шага

  Сценарий: №2 Домашнее задание по занятию 28
    * пользователь входит на сайт "https://auto.ru/"
    * Название страницы содержит "(Авто\.ру)(.+)"
    * Сохранение кол. объявлений отображаемых перед названием производителя "BMW"
    * Переход на страницу с объявлением прозводителя автомобиля "BMW"
    * Проверка отображения кнопки с текстом содержащим колличество объявлений
    * Сохранить количество объявлений "X5" марки автомобиля
    * Перейти на страницу "X5"
    * Отображается кнопка содержаще количество объявлений из предыдущего шага

  Сценарий: №3 Домашнее задание по занятию 28
    * пользователь входит на сайт "https://auto.ru/"
    * Название страницы содержит "(Авто\.ру)(.+)"
    * Сохранение кол. объявлений отображаемых перед названием производителя "Volkswagen"
    * Переход на страницу с объявлением прозводителя автомобиля "Volkswagen"
    * Проверка отображения кнопки с текстом содержащим колличество объявлений
    * Сохранить количество объявлений "Polo" марки автомобиля
    * Перейти на страницу "Polo"
    * Отображается кнопка содержаще количество объявлений из предыдущего шага