# language: ru

Функционал:

  Сценарий: №1 Домашнее задание по занятию 28
    * пользователь входит на сайт "https://auto.ru/"
    * Название страницы содержит "(Авто\.ру)(.+)"
    * Сохранение кол. объявлений отображаемых перед названием производителя "Chery"
    * Переход на страницу с объявлением прозводителя автомобиля "Chery"
    * Проверка отображения кнопки с текстом содержащим колличество объявлений из предыдущего шага
    * Сохранить количество объявлений "конкретной" марки автомобиля
    * Перейти на страницу "марки" из предыдущего шага
    * Отображается кнопка с "текстом", содержащим количество объявлений из предыдущего шага

#  Сценарий: №2 Домашнее задание по занятию 28
#    * пользователь входит на сайт "https://auto.ru/"
#    * Название страницы содержит "Авто.ру"
#    * Сохранение кол. объявлений отображаемых перед названием производителя " "
#    * Переход на страницу с объявлением прозводителя автомобиля ""
#    * ПРоверка отображения кнопки с текстом содержащим колличество объявлений из предыдущего шага
#    * Сохранить количество объявлений "конкретной" марки автомобиля
#    * Перейти на страницу "марки" из предыдущего шага
#    * Отображается кнопка с "текстом", содержащим количество объявлений из предыдущего шага
#
#  Сценарий: №2 Домашнее задание по занятию 28
#    * пользователь входит на сайт "https://auto.ru/"
#    * Название страницы содержит "Авто.ру"
#    * Сохранение кол. объявлений отображаемых перед названием производителя " "
#    * Переход на страницу с объявлением прозводителя автомобиля ""
#    * ПРоверка отображения кнопки с текстом содержащим колличество объявлений из предыдущего шага
#    * Сохранить количество объявлений "конкретной" марки автомобиля
#    * Перейти на страницу "марки" из предыдущего шага
#    * Отображается кнопка с "текстом", содержащим количество объявлений из предыдущего шага