# language: ru

  Функционал:

  Сценарий: Домашнее задание по занятию 20
    * пользователь входит на сайт
    * очищает поле логин
    * вводит логин
    * очищает поле пароль
    * вводит парль
    * нажимает кнопку войти на странице логина
    * открывается страница подтверждения
    * очищает поле подтверждения смс
    * пользователь вводит код из смс
    * нажимает кнопку войти на странице подтверждения кода из смс
    * переходит во вкладку "обзор" через верхнее меню
    * проверяет что сумма в блоке "Финансовая свобода" отображается в формате "123 456 789.00"
    * наводит курсор на сумму в блоке «Финансовая свобода» и проверяется появление суммы