# language: ru

Функционал:

  Сценарий: Домашнее задание по занятию 27
    * пользователь входит на сайт
    * Проверяет название страницы на соответствие "«Сбербанк» - Частным клиентам"
    * Переходит через верхнее меню во вклады
    * Проверяет название страницы на соответствие "«Сбербанк» - Подбор вкладов"
    * Переходит на вкладку Подобрать вклад
    * Проверка отображение чек боксов Хочу снять, Хочу пополнить, Онлайн и Я-пенсионер
    * ПРоверка что чек бокс Онлайн установлен
    * Проверка что вкладки  Сохраняй, Пополняй и Управляй отображаются
    * Пользователь проставляе чек бокы Хочу снимать и Хочу пополнять
    * Проверка что вклады Созраняй и Пополняй исчезли
    * Проверка что отображается только вклад Управляй
    * Пользователь нажимает на кнопку Подроблее у вклада Управляй
    * Проверка открытия в новом окне  страница с названием "«Сбербанк» - Вклад Управляй"
    * Проверка отображение на странице надписи Вклад Управляй