# language: ru

  Функционал:

  Сценарий: Домашнее задание по занятию 20
    * пользователь входит на сайт
    * вводит логин "demo"
    * вводит парль "demo"
    * нажимает кнопку войти на странице логина
    * открывается страница подтверждения
    * пользователь вводит код из смс "0000"
    * нажимает кнопку войти на странице подтверждения кода из смс
    * переходит во вкладку обзор через верхнее меню
    * проверить наличие суммы "2 718 764.83 ₽"
    * наводит курсор на сумму в блоке Финансовая свобода и проверяется появление суммы "Моих средств 2 936 972.64 ₽"