package work28.stepsCucumber;

import io.cucumber.java.ru.Допустим;

public class Work28Steps {


    @Допустим("Сохранить количество объявлений {string} марки автомобиля")
    public void сохранитьКоличествоОбъявленийМаркиАвтомобиля(String string) {

    }

    @Допустим("Перейти на страницу {string} из предыдущего шага")
    public void перейтиНаСтраницуИзПредыдущегоШага(String string) {

    }

    @Допустим("Отображается кнопка с {string}, содержащим количество объявлений из предыдущего шага")
    public void отображаетсяКнопкаССодержащимКоличествоОбъявленийИзПредыдущегоШага(String string) {

    }
}